### Basics Of statistics

#### 1. Measures of central tendency

1.1 MODE of the data

In [1]:
# importing pandas library
import pandas as pd
data = pd.read_excel(r"D:\Excel\releted to datascience excel files\marks_sheet.xlsx")

In [4]:
#printing first five rows of the dataset
data.head()

,First_name,Last_name,Gender,Chemistry,Maths,Biology,English,Social,Hindi,Physics,Overall_marks,Full_name,Grades,Subject
0,Yogesh,Modepalli,Male,76,74,98,90,92,92,70,592,Yogesh Modepalli,A,Python
1,Paul,Revu,Male,55,50,38,88,88,88,69,476,Paul Revu,B,Java
2,Eswar,Banoth,Male,76,60,61,63,63,63,83,469,Eswar Banoth,D,C#
3,Vasanthi,Kalvani,Female,89,67,49,69,69,69,76,488,Vasanthi Kalvani,C,java
4,Ruya Khan,Mohamadh,Female,87,65,80,76,76,76,92,552,Ruya Khan Mohamadh,D,C++

In [3]:
#printing the last five rows of the dataset
data.tail()

,First_name,Last_name,Gender,Chemistry,Maths,Biology,English,Social,Hindi,Physics,Overall_marks,Full_name,Grades,Subject
15,Shivani,Thota,Female,76,41,88,63,87,46,89,490,Shivani Thota,A,Analytics
16,Sathya_bhama,Nemilla,Female,98,33,63,69,56,98,87,504,Sathya_bhama Nemilla,A,dot net
17,Sumanjali,Ponnenkanti,Female,60,23,69,76,67,67,70,432,Sumanjali Ponnenkanti,C,salesforce
18,Geetha,Katukuri,Female,55,40,76,98,78,66,66,479,Geetha Katukuri,D,snowflake
19,Prakash,Pothukunuri,Male,88,1,11,0,88,11,87,286,Prakash Pothukunuri,B,Python

In [10]:
#calculating the MODE of the grades column
mode_data = data['Grades'].mode()
print(mode_data)

0    D
dtype: object

>here the above 'D' is the most frequently occured Grades across the dataset

##### 1.3 Mean of the Dataset

>Mean is also called as the Average. We know how to calculate the mean.{sum_of_the_quantities/total_no_of_quantities}

In [11]:
#import pandas library
import pandas as pd
data = pd.read_excel(r"D:\Excel\releted to datascience excel files\marks_sheet.xlsx")

In [12]:
#printing first five rows of the dataset
data.head()

,First_name,Last_name,Gender,Chemistry,Maths,Biology,English,Social,Hindi,Physics,Overall_marks,Full_name,Grades,Subject
0,Yogesh,Modepalli,Male,76,74,98,90,92,92,70,592,Yogesh Modepalli,A,Python
1,Paul,Revu,Male,55,50,38,88,88,88,69,476,Paul Revu,B,Java
2,Eswar,Banoth,Male,76,60,61,63,63,63,83,469,Eswar Banoth,D,C#
3,Vasanthi,Kalvani,Female,89,67,49,69,69,69,76,488,Vasanthi Kalvani,C,java
4,Ruya Khan,Mohamadh,Female,87,65,80,76,76,76,92,552,Ruya Khan Mohamadh,D,C++

In [13]:
#printing the last five rows of the dataset
data.tail()

,First_name,Last_name,Gender,Chemistry,Maths,Biology,English,Social,Hindi,Physics,Overall_marks,Full_name,Grades,Subject
15,Shivani,Thota,Female,76,41,88,63,87,46,89,490,Shivani Thota,A,Analytics
16,Sathya_bhama,Nemilla,Female,98,33,63,69,56,98,87,504,Sathya_bhama Nemilla,A,dot net
17,Sumanjali,Ponnenkanti,Female,60,23,69,76,67,67,70,432,Sumanjali Ponnenkanti,C,salesforce
18,Geetha,Katukuri,Female,55,40,76,98,78,66,66,479,Geetha Katukuri,D,snowflake
19,Prakash,Pothukunuri,Male,88,1,11,0,88,11,87,286,Prakash Pothukunuri,B,Python

In [16]:
#Calculating the Mean of the overall_marks
mean_data = data['Overall_marks'].mean()
mean_data

471.25

##### 1.4 Outliers of the Dataset

>Any value that falls outside of the data_range is called Outlier

- Suppose outlier is greter or less than the range it must be effected to the MEAN of the entire Dataset 
- To detect outlier we have to use the MEDIAN concept

##### 1.5 MEDIAN

In [21]:
#Importing library
import pandas as pd

In [22]:
#load the dataset
data = pd.read_excel(r"D:\Excel\releted to datascience excel files\marks_sheet.xlsx")

In [23]:
#printing the first 5 rows
data.head()

,First_name,Last_name,Gender,Chemistry,Maths,Biology,English,Social,Hindi,Physics,Overall_marks,Full_name,Grades,Subject
0,Yogesh,Modepalli,Male,76,74,98,90,92,92,70,592,Yogesh Modepalli,A,Python
1,Paul,Revu,Male,55,50,38,88,88,88,69,476,Paul Revu,B,Java
2,Eswar,Banoth,Male,76,60,61,63,63,63,83,469,Eswar Banoth,D,C#
3,Vasanthi,Kalvani,Female,89,67,49,69,69,69,76,488,Vasanthi Kalvani,C,java
4,Ruya Khan,Mohamadh,Female,87,65,80,76,76,76,92,552,Ruya Khan Mohamadh,D,C++

In [25]:
#Calculating the Median
median_of_data = data["Overall_marks"].median()
median_of_data

487.0

> Calculating quantile's because checking any outliers are presented in the dataset

- Quantile means 25% of the data

In [26]:
#Calculating 25%, 50%, 75%, 100% quantiles respectively.
quantile1 = data['Overall_marks'].quantile(0.25)

quantile2 = data["Overall_marks"].quantile(0.50)

quantile3 = data["Overall_marks"].quantile(0.75)

quantile4 = data["Overall_marks"].quantile(1)

In [28]:
# printing all quantiles
print("First Quantile is:---", quantile1)
print("Second Quantile is:--",quantile2)
print("third quantile is:--", quantile3)
print("fourth quantile or last quantile",quantile4)

First Quantile is:--- 444.0
Second Quantile is:-- 487.0
third quantile is:-- 507.0
fourth quantile or last quantile 592.0

##### 1.6 Spread of the data

> To measure how for the data is away from the mean or median. Here is the example program for understanding the spread of the data

In [30]:
#importing libraries
import pandas

#reading the dataset
data = pd.read_excel(r"D:\Excel\releted to datascience excel files\marks_sheet.xlsx")

In [31]:
#printing the first 5 rows of the dataset
data.head()

,First_name,Last_name,Gender,Chemistry,Maths,Biology,English,Social,Hindi,Physics,Overall_marks,Full_name,Grades,Subject
0,Yogesh,Modepalli,Male,76,74,98,90,92,92,70,592,Yogesh Modepalli,A,Python
1,Paul,Revu,Male,55,50,38,88,88,88,69,476,Paul Revu,B,Java
2,Eswar,Banoth,Male,76,60,61,63,63,63,83,469,Eswar Banoth,D,C#
3,Vasanthi,Kalvani,Female,89,67,49,69,69,69,76,488,Vasanthi Kalvani,C,java
4,Ruya Khan,Mohamadh,Female,87,65,80,76,76,76,92,552,Ruya Khan Mohamadh,D,C++

In [33]:
#Finding the min value in the Overall_marks column
minimum = data["Overall_marks"].min()
minimum

286

In [35]:
#Finding the max value in the Overall_marks column
maximum = data['Overall_marks'].max()
maximum

592

In [36]:
#finding the Range of the overall_marks column, with help of the Min and Max
range_of_OverallMarks = maximum - minimum
range_of_OverallMarks

306

>The diffrence between third quantile and first quantile is called the INTER QUANTILE RANGE

In [37]:
#Calculating the inter quartile range.(printing the third quantile and first quantile)
quantile1 = data["Overall_marks"].quantile(0.25)
quantile3 = data['Overall_marks'].quantile(0.75)

In [39]:
#finding the inter quartile Range
inter_quartile_range = quantile3 - quantile1
inter_quartile_range

63.0

#### 1.7 Calculating variance of the dataset

>Varience measures variability from the average or mean. here are steps for calculting the varience

- calculate the mean
- calculate distance from the mean of a each element
- calculate the squared distance
- take average of the squared distance
> here is the example program for calculating the varience

In [40]:
#importing the libraries
import pandas as pd
data = pd.read_excel(r"D:\Excel\releted to datascience excel files\marks_sheet.xlsx")

In [41]:
#printing the first 5 rows of the dataset
data. head()

,First_name,Last_name,Gender,Chemistry,Maths,Biology,English,Social,Hindi,Physics,Overall_marks,Full_name,Grades,Subject
0,Yogesh,Modepalli,Male,76,74,98,90,92,92,70,592,Yogesh Modepalli,A,Python
1,Paul,Revu,Male,55,50,38,88,88,88,69,476,Paul Revu,B,Java
2,Eswar,Banoth,Male,76,60,61,63,63,63,83,469,Eswar Banoth,D,C#
3,Vasanthi,Kalvani,Female,89,67,49,69,69,69,76,488,Vasanthi Kalvani,C,java
4,Ruya Khan,Mohamadh,Female,87,65,80,76,76,76,92,552,Ruya Khan Mohamadh,D,C++

In [43]:
#Step1: calculating mean of the dataset
mean_of_dataset = data["Overall_marks"].mean()
mean_of_dataset

471.25

In [45]:
#Step2: Calculate distance from the mean of a each element
distance = data["Overall_marks"] - mean_of_dataset
distance

0     120.75
1       4.75
2      -2.25
3      16.75
4      80.75
5      23.75
6    -123.25
7     -89.25
8      14.75
9     -61.25
10     33.75
11     41.75
12     50.75
13    -23.25
14     76.75
15     18.75
16     32.75
17    -39.25
18      7.75
19   -185.25
Name: Overall_marks, dtype: float64

In [46]:
#Step3: Calculate the squared distance for all the elements
squared_distance = distance**2
squared_distance

0     14580.5625
1        22.5625
2         5.0625
3       280.5625
4      6520.5625
5       564.0625
6     15190.5625
7      7965.5625
8       217.5625
9      3751.5625
10     1139.0625
11     1743.0625
12     2575.5625
13      540.5625
14     5890.5625
15      351.5625
16     1072.5625
17     1540.5625
18       60.0625
19    34317.5625
Name: Overall_marks, dtype: float64

In [51]:
#Step4: Taking the average of the squared_distance or varience
varience = squared_distance. mean()
varience

4916.4875

we can calculate the varience by using the formula. Here is the formula calculating the Varience

In [53]:
varience1 = data["Overall_marks"].var(ddof = 0)
varience1

4916.4875

#### 1.8 Calculating the Standard Deviation

>The squared root of the Varience is called  Standard deviatin. here is the steps for calculating the standard deviation.Those are

- calculate the mean
- calculate distance from the mean of a each element
- calculate the squared distance
- take average of the squared distance(it is varience)
- do the squared root of the varience(the output is standard deviation)

In [54]:
#importing the libraries
import pandas as pd
data = pd.read_excel(r"D:\Excel\releted to datascience excel files\marks_sheet.xlsx")

In [55]:
#printing the first 5 rows of the dataset
data. head()

,First_name,Last_name,Gender,Chemistry,Maths,Biology,English,Social,Hindi,Physics,Overall_marks,Full_name,Grades,Subject
0,Yogesh,Modepalli,Male,76,74,98,90,92,92,70,592,Yogesh Modepalli,A,Python
1,Paul,Revu,Male,55,50,38,88,88,88,69,476,Paul Revu,B,Java
2,Eswar,Banoth,Male,76,60,61,63,63,63,83,469,Eswar Banoth,D,C#
3,Vasanthi,Kalvani,Female,89,67,49,69,69,69,76,488,Vasanthi Kalvani,C,java
4,Ruya Khan,Mohamadh,Female,87,65,80,76,76,76,92,552,Ruya Khan Mohamadh,D,C++

In [56]:
#Step1: calculating mean of the dataset
mean_of_dataset = data["Overall_marks"].mean()
mean_of_dataset

471.25

In [57]:
#Step2: Calculate distance from the mean of a each element
distance = data["Overall_marks"] - mean_of_dataset
distance

0     120.75
1       4.75
2      -2.25
3      16.75
4      80.75
5      23.75
6    -123.25
7     -89.25
8      14.75
9     -61.25
10     33.75
11     41.75
12     50.75
13    -23.25
14     76.75
15     18.75
16     32.75
17    -39.25
18      7.75
19   -185.25
Name: Overall_marks, dtype: float64

In [58]:
#Step3: Calculate the squared distance for all the elements
squared_distance = distance**2
squared_distance

0     14580.5625
1        22.5625
2         5.0625
3       280.5625
4      6520.5625
5       564.0625
6     15190.5625
7      7965.5625
8       217.5625
9      3751.5625
10     1139.0625
11     1743.0625
12     2575.5625
13      540.5625
14     5890.5625
15      351.5625
16     1072.5625
17     1540.5625
18       60.0625
19    34317.5625
Name: Overall_marks, dtype: float64

In [59]:
#Step4: Taking the average of the squared_distance or varience
varience = squared_distance. mean()
varience

4916.4875

In [60]:
#Step5: Calculating the square_root of the varience and that is our final output called STANDARD DEVIATION
standard_deviation = varience ** (1/2)
standard_deviation

70.11766895726069

In [61]:
#We can directly get the standard deviation by using the following formula
standard_deviation1 = data["Overall_marks"].std(ddof = 0)
standard_deviation1

70.11766895726069